Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/atdf/ATSAMR30E18A.atdf
        <register modes="USART_INT" name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="USART_INT Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_USART_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="SAMPR" caption="Sample" mask="0xE000" values="SERCOM_USART_CTRLA__SAMPR"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000" values="SERCOM_USART_CTRLA__TXPO"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="SERCOM_USART_CTRLA__RXPO"/>
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_USART_CTRLA__FORM"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000" values="SERCOM_USART_CTRLA__CMODE"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_USART_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_USART_CTRLA__DORD"/>
        </register>
        <register modes="I2CM" name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="I2CM Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
        </register>
        <register modes="I2CS" name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="I2CS Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200"/>
          <bitfield name="AACKEN" caption="Automatic Address Acknowledge" mask="0x400"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
        </register>
        <register modes="SPIM" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIM Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register modes="SPIS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIS Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register modes="USART_EXT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_EXT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register modes="USART_INT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_INT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register modes="I2CM" name="BAUD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="I2CM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
          <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00"/>
          <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000"/>
          <bitfield name="HSBAUDLOW" caption="High Speed Baud Rate Value Low" mask="0xFF000000"/>
        </register>
        <register modes="SPIM" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
        <register modes="SPIS" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIS Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
